This file was created in Emacs with org-mode installed.
To have full functionality, please install Emacs with your package manager and see HOW_TO_INSTALL_ORG_MODE
Refer to the video 14 in the following class if needed: https://www.skillshare.com/classes/The-Free-Linux-Bin/1454905790 

:HOW_TO_INSTALL_ORG_MODE:
Pressing TAB on the above line should fold the content, if not ORG is not installed.

  Make sure the following code is present and at the top of your ~/.emacs file
  #+BEGIN_CODE
(package-initialize)
;; load emacs 24's package system. Add MELPA repository.
(when (>= emacs-major-version 24)
  (require 'package)
  (add-to-list
   'package-archives
   ;; 1 of the 2 next line needs to be there.
   ;;'("melpa" . "http://stable.melpa.org/packages/")
   '("melpa" . "http://melpa.milkbox.net/packages/")
   )
  (add-to-list 'package-archives    '("org" . "https://orgmode.org/elpa") t)
  )

  #+END_CODE

  Restart emacs

  Press M-x package-list-packages
  scroll down to org
  While on that line, press i then press x
  Confirm that you want to install

  Restart Emacs to be sure and the file will look way better.
:END:

:README:
How to operate org files.
Lines starting with 1 or more * are headers, press TAB while on a header, you will cycle its visibility.

src code block are contained within #+BEGIN_SRC and #+END_SRC, pressing TAB on either of those line will cycle its visiblity
You can evaluate the code within emac with the following:
C-c C-c within a code block will evaluate and display the results when possible.

You can export any code with the following:
C-c C-v t export all code block
C-u C-c C-v t export current code block (Where cursor is located)

Code block are export with the filename given in header :tangle. They are exported and are executable ready to use.

To edit a code block press C-' while your cursor is inside or on the header/footer of a src block.
A new buffer will open with the content of the block.
*** As a test operator
   Within certains expression, the ? indicates a test for a condition.
   In a double-parentheses construct it can serve as a C-style trinary operation
   #+BEGIN_SRC bash :results output :export code :tangle testOperator.sh :tangle-mode (identity #o0755) :cmdline 2>&1
     #!/bin/bash

     v0=1
     v1=2
     declare -i v2

     # The following if statement would assign v2 to either 3 or 0.
     # This will cause the sequence to become 1 2 3
     # If you invert v1 & v0, the sequence would be 2 1 0

     #if [[ $v0 < $v1 ]]; then
     #    v2=3
     #else
     #    v2=0
     #fi

     ## This does the same thing
     (( v2 = v0<v1?3:0 ))
     #            ^ ^

     echo $v0 $v1 $v2
   #+END_SRC

   #+RESULTS:
   : 1 2 3

* Parameter substitution
  Manipulating, expanding variable
  ${PARAM}
  In most case, same as $PARAM, it refers to the value of PARAM. In certain context, only the less ambiguous ${PARAM} works.
  If you seem to have issue with the value of a variable, attempt the parameter substitution ${PARAM}
  It can be used to concatenate strings.
  #+BEGIN_SRC bash :results output :exports code :tangle paramSub.sh :tangle-mode (identity #o0755) :cmdline 2>&1
    #!/bin/bash
    declare myFullString part1 part2
    part1="Hello world, "
    part2="learning python?"
    myFullString=${part1}"Bash is hard, have you considered "${part2}
    echo $myFullString
  #+END_SRC

  #+RESULTS:
  : Hello world, Bash is hard, have you considered learning python?

  We can use parameter substitution to set a default value.
  ${PARAM-DEFAULT}, ${PARAM:-DEFAULT}
  In the above structure if PARAM is not set, DEFAULT is used.
  #+BEGIN_SRC bash :results output :exports code :tangle defaultParam.sh :tangle-mode (identity #o0755) :cmdline 2>&1
    #!/bin/bash

      declare myFullString part1 part2
      part1="Hello world, "
      # This first example demonstrate the ${PARAM-DEFAULT} format, notice that part2 is declare but not set.
      myFullString=${part1}"Bash is hard, have you considered "${part2-"washing windows?"}
      echo $myFullString

      part3=
      # This first example demonstrate the ${PARAM:-DEFAULT} format
      # notice that part3 has been declared and would be null right now.
      myFullString=${part1}"Bash is hard, have you considered "${part3-"not giving up"} # This will not echo, part3 is in a sense set to NULL
      echo $myFullString

      myFullString=${part1}"Bash is hard, have you considered "${part3:-"not giving up"} # This will work
      echo $myFullString


      ## Another variable value can be used.
      replacement="that it also means it is powerfull"
      myFullString=${part1}"Bash is hard, have you considered "${part2-$replacement} # Notice the $ before replacement.

      echo $myFullString
  #+END_SRC

  #+RESULTS:
  : Hello world, Bash is hard, have you considered washing windows?
  : Hello world, Bash is hard, have you considered
  : Hello world, Bash is hard, have you considered not giving up
  : Hello world, Bash is hard, have you considered that it also means it is powerfull

  Another variance exists
  ${PARAM=DEFAULT}, ${PARAM:=DEFAULT}
  #+BEGIN_SRC bash :results output :exports code :tangle defaultParamVariation.sh :tangle-mode (identity #o0755) :cmdline 2>&1
    #!/bin/bash

      declare myFullString part1 part2
      part1="Hello world, "
      echo ${part1="Good bye."}
      echo ${part2="See you soon."}
  #+END_SRC

  #+RESULTS:x
  : Hello world,
  : See you soon.

  Let's do things a little backward shall we?
  ${PARAM+ALT_VALUE}, ${PARAM:+ALT_VALUE}
  If PARAM IS set, use ALT_VALUE otherwise, use null string.
  ':' makes a difference when PARAM has been declared and IS null.
  #+BEGIN_SRC bash :results output :exports code :tangle paramAltVal.sh :tangle-mode (identity #o0755) :cmdline 2>&1
    #!/bin/bash
    var1="hello"
    echo ${var1+"World"} # This will echo World
    echo ${var2+"World"} # This will echo null
  #+END_SRC

  #+RESULTS:

  let's not forget the usage from Special char section:
  :VARIABLEISSET:
  Test if variable has been set.
    In a Parameter substitution expression, it can test wheter a variable has been set
    Structure: ${PARAM?ERR_MSG}, ${PARAM:?ERR_MSG}
    If PARAM is set, use it, else print ERR_MSG and abort with exit 1
    Both structure are almost the same, see code for demonstration
    NOTE: Export the next code: C-u C-c C-v t
    #+BEGIN_SRC bash eval:no :export code :tangle testIfVarIsSet.sh :tangle-mode (identity #o0755) :cmdline 2>&1
      #!/bin/bash

      var1="hello"
      declare var2

      echo "--------------------"
      echo "Our variables are set:"
      echo -e "\e[32mvar1: \e[0m$var1"
      echo -e "\e[32mvar2\e[0m is declared but not set."
      echo -e "\e[32mvar3\e[0m does not exists except for the test."
      echo "--------------------"

      echo 'This test uses the following format: ${PARAM?ERR_MSG}'
      echo -e "This test code: \e[33m"'${var1?"var1 is not set"}'"\e[0m"
      echo "The test will evaluate to true and the script will continue."
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var1?"var1 is  not set"}
              echo "var1 is set: $var1"
              ;;
      esac

      echo "--------------------"
      echo 'This test uses the following format: ${PARAM?ERR_MSG}'
      echo -e "This test code: \e[33m"'${var2?"var2 is not set"}'"\e[0m"
      echo "The test will evaluate to FALSE and the script will exit code 1"
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var2?"var2 is  not set"}
              echo "var2 is set: $var2"
              ;;
      esac

      echo "--------------------"
      echo "This test is the same as the previous one, except we do not provide ERR_MSG"
      echo -e "This test code: \e[33m"'${var2?}'"\e[0m"
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var2?}
              echo "var2 is set: $var2"
              ;;
      esac

      echo "--------------------"
      echo 'This test uses the following format: ${PARAM?}'
      echo -e "This test code: \e[33m"'${var3?}'"\e[0m"
      echo "The test will evaluate to FALSE and the script will exit code 1"
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var3?"var3 is  not set"}
              echo "var3 is set: $var3"
              ;;
      esac

      echo
      echo

      echo "--------------------"
      echo 'Now we look at the other format: ${PARAM:?ERR_MSG}'
      echo "The : makes a difference when PARAM has been declared an is null"
      echo "First lets redo our first test with the ':' variation. "
      echo -e "This test code: \e[33m"'${var1:?"var1 is not set"}'"\e[0m"
      echo "The test will evaluate to true and the script will continue."
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var1:?"var1 is  not set"}
              echo "var1 is set: $var1"
              ;;
      esac

      echo "--------------------"
      echo 'This test uses the following format: ${PARAM:?ERR_MSG}'
      echo -e "This test code: \e[33m"'${var2:?"var2 is declared bu not set"}'"\e[0m"
      echo "The test will evaluate to FALSE and the script will exit code 1"
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var2:?"var2 is declare but not set"}
              echo "var2 is set: $var2"
              ;;
      esac

      echo "--------------------"
      echo "This test is the same as the previous one, except we do not provide ERR_MSG"
      echo -e "This test code: \e[33m"'${var2:?}'"\e[0m"
      echo -n "Do you want to run or skip? R/s: "
      read u
      case $u in
          [sS])
              echo "Skipping...."
              ;;
          [rR]|*) # I could just have given *)
              : ${var2:?}
              echo "var2 is set: $var2"
              ;;
      esac
    #+END_SRC
  :END:

* Command substitution
  Command substitution takes the output of 1 or more commands and plugs it into another context.
  #+BEGIN_SRC bash :results output :exports code :tangle commandSub.sh :tangle-mode (identity #o0755) :cmdline 2>&1
    #!/bin/bash

    # Consider the following:
    echo
    echo "------------"
    echo "ls -l"
    echo 'ls -l'
    echo ls -l
    echo `ls -l`

    # Command substitution can be place within backtick ``
    # Find more details in my the following class https://skl.sh/2zQFWZA


    ## Command output can be assigned to a variable
    echo
    echo "------------"
    echo "Assign ip addr to myNetCardInfo"
    myNetCardInfo=`ip addr`
    printf "$myNetCardInfo" # Notice this prints newline properly.


    echo
    echo "------------"
    echo "Using command substitution to control a for loop"
    # You can used command substitution to control loops.
    for i in `ls -A /var/log`; do
        if [ -f /var/log/$i ]; then
           echo $i
        fi
    done

    echo
    echo "------------"
    echo "I like better to use process substituion, more on that in this class: https://skl.sh/2zQFWZA"

    # I think process substitution makes for cleaner
    while read -r file; do
        if [ -f /var/log/$file ]; then
            echo $file
        fi
    done < <(ls -A /var/log)
  #+END_SRC

  #+RESULTS:
  #+begin_example

  ------------
  ls -l
  ls -l
  ls -l
  total 196 -rwxr-xr-x 1 tech papa 528 Dec 17 14:17 defaultParam.sh -rwxr-xr-x 1 tech papa 532 Dec 18 16:13 envVar.sh -rw-r--r-- 1 tech papa 49571 Dec 18 16:22 #notes.org# -rw-r--r-- 1 tech papa 46596 Dec 18 16:20 notes.org -rw-r--r-- 1 tech papa 79213 Dec 17 08:39 notes.org~ -rwxr-xr-x 1 tech papa 217 Dec 17 16:53 remLed0.sh -rwxr-xr-x 1 tech papa 3489 Dec 18 10:23 testIfVarIsSet.sh

  ------------
  Assign ip addr to myNetCardInfo
  1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
      link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
      inet 127.0.0.1/8 scope host lo
         valid_lft forever preferred_lft forever
      inet6 ::1/128 scope host 
         valid_lft forever preferred_lft forever
  2: enp0s25: <NO-CARRIER,BROADCAST,MULTICAST,UP> mtu 1500 qdisc fq_codel state DOWN group default qlen 1000
      link/ether 3c:97:0e:17:7d:a7 brd ff:ff:ff:ff:ff:ff
  3: wlp3s0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc mq state UP group default qlen 1000
      link/ether 8c:70:5a:f2:79:84 brd ff:ff:ff:ff:ff:ff
      inet 192.168.0.10/24 brd 192.168.0.255 scope global dynamic noprefixroute wlp3s0
         valid_lft 594392sec preferred_lft 594392sec
      inet6 fd00:f81d:f7b:de22:21f4:ff5:82f9:ff7f/64 scope global temporary dynamic 
         valid_lft 523852sec preferred_lft 5175sec
      inet6 fd00:f81d:f7b:de22:6564:c5ea:35d1:efa/64 scope global temporary deprecated dynamic 
         valid_lft 437732sec preferred_lft 0sec
      inet6 fd00:f81d:f7b:de22:89d3:c25:6259:b466/64 scope global temporary deprecated dynamic 
         valid_lft 351611sec preferred_lft 0sec
      inet6 fd00:f81d:f7b:de22:b72:c972:69a6:65c2/64 scope global dynamic mngtmpaddr noprefixroute 
         valid_lft 535428sec preferred_lft 401571sec
      inet6 fe80::b1d:6c8d:bed3:9ea6/64 scope link noprefixroute 
         valid_lft forever preferred_lft forever
  6: wwp0s20u4i6: <BROADCAST,MULTICAST> mtu 1500 qdisc noop state DOWN group default qlen 1000
      link/ether 02:80:37:ec:02:00 brd ff:ff:ff:ff:ff:ff
  ------------
  Using command substitution to control a for loop
  alternatives.log
  alternatives.log.1
  apport.log
  apport.log.1
  apport.log.2.gz
  apport.log.3.gz
  auth.log
  auth.log.1
  auth.log.2.gz
  auth.log.3.gz
  auth.log.4.gz
  boot.log
  bootstrap.log
  btmp
  btmp.1
  dpkg.log
  dpkg.log.1
  faillog
  fontconfig.log
  gpu-manager.log
  kern.log
  kern.log.1
  kern.log.2.gz
  kern.log.3.gz
  kern.log.4.gz
  lastlog
  syslog
  syslog.1
  syslog.2.gz
  syslog.3.gz
  syslog.4.gz
  syslog.5.gz
  syslog.6.gz
  syslog.7.gz
  tallylog
  wtmp
  wtmp.1
  Xorg.0.log
  Xorg.0.log.old
  Xorg.1.log
  Xorg.1.log.old
  Xorg.2.log
  Xorg.2.log.old

  ------------
  I like better to use process substituion, more on that in this class: https://skl.sh/2zQFWZA
  alternatives.log
  alternatives.log.1
  apport.log
  apport.log.1
  apport.log.2.gz
  apport.log.3.gz
  auth.log
  auth.log.1
  auth.log.2.gz
  auth.log.3.gz
  auth.log.4.gz
  boot.log
  bootstrap.log
  btmp
  btmp.1
  dpkg.log
  dpkg.log.1
  faillog
  fontconfig.log
  gpu-manager.log
  kern.log
  kern.log.1
  kern.log.2.gz
  kern.log.3.gz
  kern.log.4.gz
  lastlog
  syslog
  syslog.1
  syslog.2.gz
  syslog.3.gz
  syslog.4.gz
  syslog.5.gz
  syslog.6.gz
  syslog.7.gz
  tallylog
  wtmp
  wtmp.1
  Xorg.0.log
  Xorg.0.log.old
  Xorg.1.log
  Xorg.1.log.old
  Xorg.2.log
  Xorg.2.log.old
  #+end_example

